# BuiltInFailures.PathFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathFailures Class
BuiltInFailures Class Members See Also
---
Failures about Path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PathFailures
```

Visual Basic
---
```text
Public NotInheritable Class PathFailures
```

Visual C++
---
```text
public ref class PathFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PathFailures
# See Also
BuiltInFailures..::..PathFailures Members
Autodesk.Revit.DB Namespace